УРВ_файловая/src/Catalogs/Соглашения/Соглашения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Соглашения</name>
  <attributes>
    <name>ИспользоватьВажность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКомпонентСервиса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРаздел</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЛиниюПоддержки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСостояние</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТипОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеРеквизитыСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАбонент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеРеквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.КлючевыеРеквизитыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыСоглашения</name>
    <attributes>
      <name>КлючПараметров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>EnumRef.ТипыОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>Важность</name>
      <type>
        <types>EnumRef.ВариантыВажности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛинияПоддержки</name>
      <type>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОбращения</name>
      <type>
        <types>EnumRef.СостоянияОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>КомпонентСервиса</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОбработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРеакции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Абонент</name>
      <type>
        <types>CatalogRef.Абоненты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Перенаправления</name>
    <attributes>
      <name>КлючПараметров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>EnumRef.ВыраженияПолучателей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСрываСроков</name>
      <type>
        <types>EnumRef.ТипыСрывовСроков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оповещения</name>
    <attributes>
      <name>КлючПараметров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>EnumRef.ВыраженияПолучателей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ЛинииПоддержки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОповещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСрываСроков</name>
      <type>
        <types>EnumRef.ТипыСрывовСроков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Соглашения/ObjectModule.bsl
#Область ОбработчикиСобытий
    
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;  
	КонецЕсли;
    
	ИспользоватьКомпонентСервиса = Ложь;
	ИспользоватьЛиниюПоддержки = Ложь;
	ИспользоватьТипОбращения = Ложь;
	ИспользоватьСостояние = Ложь;
	ИспользоватьВажность = Ложь;
	ИспользоватьРаздел = Ложь;
	//+ Котова А.Ю. 06.11.2018 ТЗ№ 74355 {
	ИспользоватьАбонент = Ложь;
	ИспользоватьПроект = Ложь;
	//- Котова А.Ю. 06.11.2018 ТЗ№ 74355 }
	КлючевыеРеквизитыСтрокой = "";
	
	Для каждого Строка Из КлючевыеРеквизиты Цикл
		
		КлючевыеРеквизитыСтрокой = КлючевыеРеквизитыСтрокой + ?(ПустаяСтрока(КлючевыеРеквизитыСтрокой), "", "; ") + Строка.Реквизит;
		
		Если Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.ТипОбращения Тогда
			ИспользоватьТипОбращения = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.Важность Тогда
			ИспользоватьВажность = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.ЛинияПоддержки Тогда
			ИспользоватьЛиниюПоддержки = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.КомпонентСервиса Тогда
			ИспользоватьКомпонентСервиса = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.Раздел Тогда
			ИспользоватьРаздел = Истина;
            
        ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.СостояниеОбращения Тогда
			ИспользоватьСостояние = Истина;
			//+ Котова А.Ю. 06.11.2018 ТЗ№ 74355 {
		ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.Абонент Тогда
			ИспользоватьАбонент = Истина;
		ИначеЕсли Строка.Реквизит = ПланыВидовХарактеристик.КлючевыеРеквизитыОбращений.Проект Тогда
			ИспользоватьПроект = Истина;
			//- Котова А.Ю. 06.11.2018 ТЗ№ 74355 }
        КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Оповещение Из Оповещения Цикл
		Если Не ЗначениеЗаполнено(СокрЛП(Оповещение.КлючОповещения)) Тогда
			Оповещение.КлючОповещения = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Для каждого Строка Из ПараметрыСоглашения Цикл
		СтрокиПеренаправления = Перенаправления.НайтиСтроки(Новый Структура("КлючПараметров", Строка.КлючПараметров));
		СтрокиОповещений = Оповещения.НайтиСтроки(Новый Структура("КлючПараметров", Строка.КлючПараметров));
		
		НовыйКлючПараметров = Строка(Новый УникальныйИдентификатор);
		Строка.КлючПараметров = НовыйКлючПараметров;
		Для каждого Строка Из СтрокиПеренаправления Цикл
			Строка.КлючПараметров = НовыйКлючПараметров;
		КонецЦикла; 
		Для каждого Строка Из СтрокиОповещений Цикл
			Строка.КлючПараметров = НовыйКлючПараметров;
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    
    Если ОбменДанными.Загрузка = Истина Тогда
        Возврат;
    КонецЕсли;
    
    Справочники.Соглашения.ЗапуститьРасчетСроковОбращенийВФоне(Ссылка);
    
КонецПроцедуры

#КонецОбласти
